import streamlit as st
from CoolProp.CoolProp import PropsSI
import pandas as pd


st.title(" Цикл Ренкіна — розрахунок ККД")


st.header(" Вхідні дані")

P1 = 2e6
P2 = 0.004e6
v = 0.001  

t1 = st.slider("Температура t1 (°C)", 240, 360, 300)
T1 = t1 + 273.15

st.write(f"P1 = 2 MPa = {P1} Pa")
st.write(f"P2 = 0.004 MPa = {P2} Pa")
st.write(f"t1 = {t1} °C = {T1:.2f} K")

# теоретичні відомості
with st.expander(" Теоретичні відомості (цикл Ренкіна + Карно)"):

    st.markdown("""
##  Цикл Ренкіна
Складається з 4 процесів:

1 → 2: Турбіна (ізоентропне розширення)  
2 → 3: Конденсатор (охолодження)  
3 → 4: Насос (стиск рідини)  
4 → 1: Котел (нагрів і пароутворення)

---

##  Формули циклу Ренкіна

 **Робота турбіни:**
 $$ L_t = h_1 - h_2 $$

 **Робота насоса:**
 $$ L_n = v (P_1 - P_2) = h_4 - h_3$$,

 звідси ми зможемо знайти:

 $$ h_4 => h_4 = h_3 + L_n $$,

 **Корисна робота:**
 $$ L_{net} = L_t - L_n  = (h_1 - h_2) - (h_4 - h_3)$$

 **ККД:**
 $$ \\eta = \\frac{L_{net}}{h_1 - h_3}  = \\frac{(h_1 - h_2) - (h_4 - h_3)}{h_1 - h_3}, $$

 **де:**

 $$  h_1, P_1, t_1 $$ - параметри (ентальпія (кДж/кг), тиск (Па), температура (К) відповідно) з якими генерується водяна пара 

 $$  h_2, P_2, t_2 $$ - параметри (ентальпія (кДж/кг), тиск (Па), температура (К) відповідно) після парової турбіни (кінцеві параметри)

 $$  v $$ - питомий об’єм води (м³/кг) - приблизно 0.001 для води

---
##  Цикл Карно:
$$ \\eta_{Carnot} = 1 - \\frac{T_{cold}}{T_{hot}} $$

- $T_{hot}$ — температура джерела теплоти (пара з котла)
- $T_{cold}$ — температура холодильника (конденсація пари)

Цикл Карно вважають ідеальним, тому що він:
- не враховує втрати
- не має тертя
- не має необоротностей

Тому його ККД завжди вищий за реальні цикли (наприклад, як в даному випадку Ренкіна)
""")


# розрахунок для 300 градусів

h1 = PropsSI('H', 'P', P1, 'T', T1, 'Water') / 1000
s1 = PropsSI('S', 'P', P1, 'T', T1, 'Water')

h3 = PropsSI('H', 'P', P2, 'Q', 0, 'Water') / 1000
s3 = PropsSI('S', 'P', P2, 'Q', 0, 'Water')

h2 = PropsSI('H', 'P', P2, 'S', s1, 'Water') / 1000

Ln = v * (P1 - P2) / 1000
h4 = h3 + Ln

eta = ((h1 - h2) - (h4 - h3)) / (h1 - h3)

# РЕЗУЛЬТАТИ

st.write("### Проміжні результати:")
st.write(f"h1 = {h1:.2f} kJ/kg")
st.write(f"h2 = {h2:.2f} kJ/kg")
st.write(f"h3 = {h3:.2f} kJ/kg")
st.write(f"Ln = {Ln:.2f} kJ/kg")
st.write(f"h4 = {h4:.2f} kJ/kg")

st.subheader(f"Результати для вибраного t1 (на слайдері - {t1}°C):")

st.metric("ККД циклу Ренкіна", f"{eta:.3f}")



st.header(" Вплив температури t1 на ККД")

t_values = list(range(240, 361, 10))
etas = []

for t in t_values:
    T = t + 273.15

    h1 = PropsSI('H', 'P', P1, 'T', T, 'Water') / 1000
    s1 = PropsSI('S', 'P', P1, 'T', T, 'Water')

    h2 = PropsSI('H', 'P', P2, 'S', s1, 'Water') / 1000
    h3 = PropsSI('H', 'P', P2, 'Q', 0, 'Water') / 1000

    Ln = v * (P1 - P2) / 1000
    h4 = h3 + Ln

    eta_loop = ((h1 - h2) - (h4 - h3)) / (h1 - h3)
    etas.append(eta_loop)

df = pd.DataFrame({
    "t1 (°C)": t_values,
    "η": etas
})

st.dataframe(df)

st.line_chart(df.set_index("t1 (°C)"))

st.info("Можемо побачити, що ККД зростає зі збільшенням температури перегріву пари t1")

with st.expander(" ККД циклу Карно"):


    T_cold = PropsSI('T', 'P', P2, 'Q', 0, 'Water')

    eta_carnot = 1 - T_cold / T1

    st.metric("ККД Карно", f"{eta_carnot:.3f}")
    st.write(f"T_hot = {T1:.2f} K")
    st.write(f"T_cold = {T_cold:.2f} K")
    
st.subheader("Порівняння циклів")

st.write(f"ККД Ренкіна = {eta:.3f}")
st.write(f"ККД Карно = {eta_carnot:.3f}")

diff = eta_carnot - eta

st.info(f"Різниця між ідеальним і реальним циклом: {diff:.3f}")


st.subheader("📌 Висновок")

st.markdown("""
У ході роботи було досліджено термодинамічний цикл Ренкіна та вплив температури перегріву пари на його ККД.

Отримані результати показали, що:
- зі збільшенням температури t1 ККД циклу зростає;
- реальний цикл Ренкіна має значно нижчий ККД у порівнянні з ідеальним циклом Карно.

Для t1 = 300°C було отримано:
- ККД Ренкіна ≈ 0.339  
- ККД Карно ≈ 0.473  

Різниця пояснюється необоротностями процесів у реальних теплових установках (тертя, втрати тепла, неідеальне розширення та стиснення).

Таким чином, цикл Карно визначає верхню теоретичну межу ефективності теплових машин.
""")